OdDAI.ConstructedType.type
\details
Retreives a type code of contained type.
\returns Returns a smart pointer to type code of contained type.

OdDAI.ConstructedType.selections
\details
Retreives a set of selectable types.
\returns Returns a set of selectable types.

OdDAI.ConstructedType.elements
\details
Retreives a list of values of enumeration type.
\returns Returns a list of values of enumeration type.

OdDAI.ConstructedType
\details
Container for enumeration type or select type.